The collection of analytical shading surfaces.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public IList<EnergyAnalysisSurface> GetAnalyticalShadingSurfaces()
  Visual Basic
Public Function GetAnalyticalShadingSurfaces As IList(Of EnergyAnalysisSurface)
  Visual C++
public:
IList<EnergyAnalysisSurface^>^ GetAnalyticalShadingSurfaces()
 Return Value
 Returns the analytical shading surfaces after model calculation.
 See Also
  EnergyAnalysisDetailModel Class
  Autodesk.Revit.DB.Analysis Namespace